Merge pull request #9 from joeycmlam/feat/team-agent
Feat/team agent
